app/controllers/events_controller.rb

  def all
    events = Event.all
    puts "DATETIME!!"
    puts DateTime.now
    puts DateTime.now.beginning_of_day
    puts DateTime.now.tomorrow.to_date

    params["period"] = "this_week"

    if params["period"] == "today"
      puts "AMERICA"
      events = Event.where('start_date_and_time BETWEEN ? AND ?', DateTime.now.beginning_of_day, DateTime.now.end_of_day).all
      # events = Event.where(start_date_and_time.to_date Datetime.now.to_date)
      # events = Event.where("start_date_and_time = Datetime.now.to_date")
      # Datetime.now.to_date
    elsif params["period"] == "tomorrow"
      events = Event.where('start_date_and_time BETWEEN ? AND ?', DateTime.now.beginning_of_day + 1.days, DateTime.now.end_of_day + 1.days).all
    elsif params["period"] == "this_week"
      events = Event.where('start_date_and_time BETWEEN ? AND ?', DateTime.now.beginning_of_day, DateTime.now.end_of_day + 6.days).all
    end

    @events_json = events.map do |event|
        event.as_json.merge(:numberOfAttendees => event.attendances.count)
---
SELECT "events".* FROM "events"
SELECT COUNT(*) FROM "attendances" WHERE "attendances"."event_id" = $1  [["event_id", 1]]

  def show
    @event = Event.find(params[:id])
    @attend = Attendance.find_by(event: @event, user_id: session[:user_id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 12]]
SELECT  "attendances".* FROM "attendances" WHERE "attendances"."event_id" = 14 AND "attendances"."user_id" = 12 LIMIT 1