app/controllers/session_controller.rb

  def create
    @user = User.find_by_username(params[:session][:username])
    @user ||= User.find_by_email(params[:session][:username])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "bob@gmail.com"]]