app/controllers/welcome_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 12]]
SELECT "events".* FROM "events" INNER JOIN "attendances" ON "events"."id" = "attendances"."event_id" WHERE "attendances"."user_id" = $1  [["user_id", 7]]
SELECT  "schools".* FROM "schools" WHERE "schools"."id" = $1 LIMIT 1  [["id", 9]]
SELECT "users".* FROM "users" WHERE "users"."school_id" = $1  [["school_id", 9]]
---
  def dashboard
      @user_events = User.find(session[:user_id]).events_attended
      school = User.find(session[:user_id]).school